tap "adoptopenjdk/openjdk"
tap "aws/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "robotsandpencils/made"
tap "supabase/tap"
# Run your GitHub Actions locally 🚀
brew "act"
# Automate deployment, configuration, and upgrading
brew "ansible"
# All in one for **env
brew "anyenv"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Collection of portable C++ source libraries
brew "boost"
# Command-line tool to manipulate Android App Bundles
brew "bundletool"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Console Matrix
brew "cmatrix"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Load/unload environment variables based on $PWD
brew "direnv"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# Shared library for Watchman and Eden projects
brew "edencommon"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Remote repository management made easy
brew "ghq"
# Platform built on V8 to build network applications
brew "node"
# Interactive command-line tool for using emoji in commit messages
brew "gitmoji"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Simple terminal UI for git commands
brew "lazygit"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Simplistic interactive filtering tool
brew "peco"
# 📦🚀 Fast, disk space efficient package manager
brew "pnpm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Tool Command Language
brew "tcl-tk", link: false
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Command-line interface to the freedesktop.org trashcan
brew "trash-cli"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Next generation frontend tooling. It's fast!
brew "vite"
# Watch files and take action when they change
brew "watchman"
# JavaScript package manager
brew "yarn"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# AWS SAM CLI 🐿 is a tool for local development and testing of Serverless applications
brew "aws/tap/aws-sam-cli"
# Install and switch between multiple versions of Xcode
brew "robotsandpencils/made/xcodes"
# Supabase CLI
brew "supabase/tap/supabase"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# JDK from the Java User Group (JUG)
cask "adoptopenjdk"
# Chromium based browser
cask "arc"
# Tools for building Android applications
cask "android-studio"
# SQL client and database management tool
cask "arctype"
# Group chat software
cask "chatwork"
# Clipboard extension app
cask "clipy"
cask "cmd-eikana"
# Universal database tool and SQL client
cask "dbeaver-community"
# Trains AIs to understand and translate texts
cask "deepl"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Reimagine your terminal
cask "fig"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Shows hidden files and folders and switches their visibility in Finder
cask "funter"
# Web browser
cask "google-chrome"
# Japanese input software
cask "google-japanese-ime"
# Screenshot and screen recording tool
cask "gyazo"
# Terminal built on web technologies
cask "hyper"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Open-source keystroke visualizer
cask "keycastr"
# Interface for reading and syncing eBooks
cask "kindle"
# Visual user interface for Docker Container management
cask "kitematic"
# App to write, plan, collaborate, and get organized
cask "notion"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Web browser
cask "safari-technology-preview"
# MySQL/MariaDB database management platform
cask "sequel-pro"
# Native GUI tool for relational databases
cask "tableplus"
# Development environment
cask "vagrant"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password 7", id: 1333542190
mas "Alfred", id: 405843582
mas "Apple Configurator", id: 1037126344
mas "CopyClip", id: 595191960
mas "Developer", id: 640199958
mas "GarageBand", id: 682658836
mas "HiddenMe", id: 467040476
mas "Keynote", id: 409183694
mas "Keystroke Pro", id: 1572206224
mas "LINE", id: 539883307
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Skitch", id: 425955336
mas "Slack", id: 803453959
mas "Transporter", id: 1450874784
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "ajmnz.prisma-import"
vscode "Arjun.swagger-viewer"
vscode "astro-build.astro-vscode"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "bungcip.better-toml"
vscode "byCedric.vscode-expo"
vscode "christian-kohler.path-intellisense"
vscode "codecov.codecov"
vscode "CodeQue.codeque"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "github.vscode-github-actions"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "kamikillerto.vscode-colorize"
vscode "KyleDavidE.vscode-project-links"
vscode "mattpocock.ts-error-translator"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "ms-vsliveshare.vsliveshare"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "Orta.vscode-jest"
vscode "PKief.material-icon-theme"
vscode "Prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "seatonjiang.gitmoji-vscode"
vscode "Shan.code-settings-sync"
vscode "streetsidesoftware.code-spell-checker"
vscode "sysoev.language-stylus"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "VisualStudioExptTeam.vscodeintellicode-completions"
vscode "vscode-icons-team.vscode-icons"
vscode "withfig.fig"
vscode "wix.vscode-import-cost"
vscode "xyc.vscode-mdx-preview"
vscode "xyz.local-history"
vscode "yoavbls.pretty-ts-errors"
vscode "yusukehirao.vscode-markuplint"
vscode "yzhang.markdown-all-in-one"
